blogs/finite-elements-from-scratch-in-python.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-30 Thu 13:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Finite Elements From Scratch (in Python)</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.7.2/css/all.min.css">
<link href="https://fonts.googleapis.com/css2?family=Roboto+Serif:ital,opsz,wght@0,8..144,100..900;1,8..144,100..900&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/css/styles.css" />
<base target="_blank">
</head>
<body>
<div id="preamble" class="status">
<nav>
    <!-- Checkbox for toggling menu -->
    <input type="checkbox" id="check">
    <!-- Menu icon -->
    <label for="check" class="checkbtn">
      <i class="fas fa-bars"></i>
    </label>
    <!-- Site logo -->
    <label class="logo"><a href="/index.html">Go Van Go</a></label>
    <!-- Navigation links -->
    <ul class="navbar-ul">
      <li><a target="_self" class="active" href="/index.html">Home</a></li>
      <li><a target="_self" href="/about.html">About</a></li>
      <li><a target="_self" href="/blog.html">Blog</a></li>
      <li><a target="_self" href="/contact.html">Contact</a></li>
    </ul>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">Finite Elements From Scratch (in Python)
<br>
<span class="subtitle">and how to pick the right one for your simulation</span>
</h1>
<p class="date"><i>last update: Jan 30, 2025</i></p>

<div id="three-js-container"></div>
<p>
<b>Interactive</b> 3D visualization of a <b>reference tetrahedron</b> for a finite element mesh. <span class="underline"><b>Click and drag</b></span> to move around the mesh.<br>
</p>

<script type="module" src="/assets/js/reference-tetrahedron.js"></script>
<div id="outline-container-orgaa385df" class="outline-2">
<h2 id="orgaa385df">Article Motivation</h2>
<div class="outline-text-2" id="text-orgaa385df">
<blockquote>
<ul class="org-ul">
<li>What is a finite element?<br></li>
<li>How does it relate to a mesh?<br></li>
<li>Which is the right element for my simulation?<br></li>
<li>Code it in python.<br></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-org6a88b19" class="outline-2">
<h2 id="org6a88b19">What is a finite element?</h2>
<div class="outline-text-2" id="text-org6a88b19">
<p>
Note: were talking about specific elements that are used in finite element analysis (FEA), not the finite element method (FEM) as a whole.<br>
</p>

<p>
There are two ways to explain finite elements, the simple way and the rigorous mathematical way.<br>
</p>

<p>
The simple way<br>
</p>

<p>
The rigous mathematical one is usually taken from <i>The Mathematical Theory of Finite Element Methods</i> by Brenner and Scott [1]. Their definition expands on the classic 1978 definition from P. Ciarlet [2].<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
   <p>Go Van Go!</p>
   <a href="https://github.com/go-van-go" target="_blank" rel="noopener noreferrer">
     <i class="fa fa-github githubfooter"></i>
   </a>
</footer>
</div>
</body>
</html>
